{
  "intents": [
   	 {
      	 "tag": "greetings",
      	 "patterns": [ "hello", "hey", "hi", "good day", "greetings", "what's up?", "how is it going" ],
      	 "responses": [ "hello", "hey!", "what can i do for you?" ],
      	 "context": [ "" ]
    	},
            {
                "tag": "health issues",
                "patterns": ["What are some common health issues during pregnancy?","health issues at this time","tell some health issues"],
                "responses": ["Several common health issues during pregnancy include 1.gestational diabetes,2.preeclampsia,3.anemia,4.urinary tract infections, 5.gestational hypertension, 6.preterm labor, 7.placenta previa, 8.miscarriage, 9.ectopic pregnancy, 10.hyperemesis gravidarum, 11.Group B Streptococcus infection,12. Rh factor incompatibility. It's important to consult with your healthcare provider for personalized guidance and monitoring.Type its number for more information."],
                "context": [""]
              },              
            {
                "tag": "health",
                "patterns": ["How can I ensure a healthy pregnancy?","healthy pregnancy"],
                "responses": ["Maintaining a balanced diet, regular exercise, regular prenatal check-ups, and avoiding harmful substances like alcohol and tobacco are crucial for a healthy pregnancy."],
                "context": [""]
            },
            {
                "tag": "nutrition",
                "patterns": ["What should I include in my prenatal diet?","what food I have to eat?"],
                "responses": ["A well-rounded prenatal diet should include essential nutrients like folic acid, iron, calcium, and omega-3 fatty acids. Consult your healthcare provider for personalized dietary recommendations."],
                "context": [""]
            },
            {
                "tag": "exercise",
                "patterns": ["Is it safe to exercise during pregnancy?","what exercises i do?","suggest some exercises"],
                "responses": ["Yes, moderate exercise is generally safe and can have numerous benefits during pregnancy. Always consult your healthcare provider before starting or continuing any exercise routine."],
                "context": [""]
            },
            {
                "tag": "weight",
                "patterns": ["How much weight should I gain during pregnancy?"],
                "responses": ["Weight gain recommendations vary based on pre-pregnancy BMI. Generally, a healthy weight gain ranges from 25 to 35 pounds for most women. Your healthcare provider can provide specific guidance."],
                "context": [""]
            },
            {
                "tag": "discomforts",
                "patterns": ["What are common discomforts during pregnancy and how can I manage them?","discomforts at this time"],
                "responses": ["Common discomforts include nausea, back pain, and fatigue. Eating small, frequent meals, practicing good posture, and getting adequate rest can help manage these discomforts. Always inform your healthcare provider about any persistent issues."],
                "context": [""]
            },
            {
                "tag": "travel",
                "patterns": ["Is it safe to travel during pregnancy?","about travel","visiting new places"],
                "responses": ["In most cases, it's safe to travel during the second trimester. However, always check with your healthcare provider before making any travel plans. Avoid long periods of immobility and stay hydrated."],
                "context": [""]
            },
            {
                "tag": "work",
                "patterns": ["Can I continue working during pregnancy?","job at this period","job at this time","about work"],
                "responses": ["Many women continue working throughout pregnancy. Discuss any concerns or modifications needed for your job with your employer and healthcare provider. Take breaks and listen to your body."],
                "context": [""]
            },
            {
                "tag": "checkups",
                "patterns": ["How often should I see my healthcare provider during pregnancy?","checkups at this time","healthcare provider","meet the doctor","checkups"],
                "responses": ["Regular prenatal check-ups are essential. Typically, visits are scheduled monthly in the first and second trimesters, and more frequently in the third trimester. Follow your healthcare provider's recommendations."],
                "context": [""]
            },
            {
                "tag": "medications",
                "patterns": ["Are over-the-counter medications safe during pregnancy?","medications at this time?","medications"],
                "responses": ["Some over-the-counter medications are safe, but it's crucial to consult your healthcare provider before taking any medication during pregnancy. Avoid self-medication, especially in the first trimester."],
                "context": [""]
            },
            {
                "tag": "warningsigns",
                "patterns": ["What are warning signs that something might be wrong during pregnancy?"],
                "responses": ["Warning signs include severe abdominal pain, vaginal bleeding, sudden swelling, severe headaches, and decreased fetal movement. If you experience any of these, contact your healthcare provider immediately."],
                "context": [""]
            },
            {
                "tag": "sickness",
                "patterns": ["How can I deal with morning sickness?"],
                "responses": ["To manage morning sickness, try eating small, frequent meals, staying hydrated, and consuming ginger products. If symptoms persist, consult your healthcare provider for further advice."],
                "context": [""]
            },
            {
                "tag": "foods",
                "patterns": ["Are there specific foods I should avoid during pregnancy?","food i donot eat?","what food i have to avoid?"],
                "responses": ["Some foods, like raw seafood, unpasteurized dairy, and certain deli meats, should be avoided during pregnancy due to the risk of foodborne illnesses. Consult your healthcare provider for a comprehensive list."],
                "context": [""]
            },
            {
                "tag": "exercises",
                "patterns": ["What exercises should I avoid during pregnancy?"],
                "responses": ["While most exercises are safe, activities with a high risk of falling or abdominal trauma should be avoided. Consult your healthcare provider for personalized exercise recommendations based on your health and fitness level."],
                "context": [""]
            },
            {
                "tag": "backpain",
                "patterns": ["How can I manage pregnancy-related back pain?"],
                "responses": ["Maintain good posture, practice gentle stretching exercises, and consider prenatal yoga. If back pain persists, inform your healthcare provider for guidance and potential referral to a physical therapist."],
                "context": [""]
            },
            {
                "tag": "hair",
                "patterns": ["Can I dye my hair during pregnancy?"],
                "responses": ["Limited evidence suggests that hair dye is generally safe during pregnancy, especially after the first trimester. However, consider using ammonia-free products and ensure good ventilation. Consult your healthcare provider for personalized advice."],
                "context": [""]
            },
            {
                "tag": "diabetes",
                "patterns": ["What is gestational diabetes, and how is it managed?"],
                "responses": ["Gestational diabetes is a type of diabetes that develops during pregnancy. Management includes a balanced diet, regular exercise, and, in some cases, medication. Your healthcare provider will provide guidance based on your specific situation."],
                "context": [""]
            },
            {
                "tag": "preparing",
                "patterns": ["How can I prepare for labor and delivery?"],
                "responses": ["Attend prenatal classes, create a birth plan, and discuss pain relief options with your healthcare provider. Familiarize yourself with the labor and delivery process to alleviate anxiety."],
                "context": [""]
            },
            {
                "tag": "worktravel",
                "patterns": ["Can I still travel for work during pregnancy?"],
                "responses": ["Travel decisions depend on various factors, including your health, the stage of pregnancy, and the nature of your work. Consult your healthcare provider and employer to assess the feasibility and safety of work-related travel."],
                "context": [""]
            },
            {
                "tag": "postpartumdepression",
                "patterns": ["What is postpartum depression, and how can it be addressed?"],
                "responses": ["Postpartum depression is a mood disorder that can affect new mothers. Seeking support from loved ones, attending postpartum support groups, and discussing concerns with a healthcare provider are essential for early detection and effective management."],
                "context": [""]
            },
            {
                "tag": "sex",
                "patterns": ["Is it safe to have sex during pregnancy?","what about sex?"],
                "responses": ["In most cases, it is safe to have sex during pregnancy. However, consult your healthcare provider to discuss any specific concerns or restrictions based on your health and pregnancy status."],
                "context": [""]
            },
            {
                "tag": "birthplan",
                "patterns": ["What is a birth plan, and how do I create one?"],
                "responses": ["A birth plan outlines your preferences for labor and delivery. Discuss it with your healthcare provider and include preferences for pain relief, interventions, and postpartum care. Keep it flexible as circumstances may change."],
                "context": [""]
            },
            {
                "tag": "stress",
                "patterns": ["How can I manage stress during pregnancy?"],
                "responses": ["Managing stress during pregnancy is crucial. Practice relaxation techniques, seek support from loved ones, and consider prenatal yoga or meditation. If stress becomes overwhelming, consult your healthcare provider."],
                "context": [""]
            },
            {
                "tag": "travel",
                "patterns": ["Can I still travel for leisure during pregnancy?"],
                "responses": ["Travel for leisure during pregnancy is generally safe in the second trimester. Consult your healthcare provider for advice, and consider factors such as destination, duration, and mode of travel."],
                "context": [""]
            },
            {
                "tag": "vitamins",
                "patterns": ["What is the importance of prenatal vitamins?"],
                "responses": ["Prenatal vitamins provide essential nutrients like folic acid, iron, and calcium crucial for fetal development. Taking them as recommended by your healthcare provider helps fill nutritional gaps during pregnancy."],
                "context": [""]
            },
            {
                "tag": "preconception",
                "patterns": ["How can I improve my chances of getting pregnant?"],
                "responses": ["Maintain a healthy lifestyle with a balanced diet and regular exercise. Understand your menstrual cycle, have regular intercourse during your fertile window, and consult your healthcare provider for preconception advice."],
                "context": [""]
            },
            {
                "tag": "insomnia",
                "patterns": ["How can I cope with pregnancy-related insomnia?"],
                "responses": ["Establish a bedtime routine, limit caffeine intake, and create a comfortable sleep environment. If insomnia persists, consult your healthcare provider for safe solutions during pregnancy."],
                "context": [""]
            },
            {
                "tag": "mood",
                "patterns": ["Is it normal to have mood swings during pregnancy?"],
                "responses": ["Yes, mood swings are common due to hormonal changes. Practice self-care, communicate with your partner, and seek support from friends and family. If mood swings are severe, consult your healthcare provider."],
                "context": [""]
            }
  ]
}
                                                                                                                                                                                                                                                     